constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType      LES;

LES
{
    LESModel        Smagorinsky;
	SmagorinskyCoeffs
	{
		Ce				1.048;
		Ck				0.094;
	}

	delta			vanDriest;  // フィルター幅
	vanDriestCoeffs
	{
		delta			cubeRootVol;
		cubeRootVolCoeffs
		{
			deltaCoeff		1;
		}
		Aplus			26;
		Cdelta			0.158;
	}

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
